#include <stdio.h>

int main(void) {
    /**
     * #include - вмъква заглавни файлове в текущия файл.
     * 
     * #define - създава макрота в C
     * 
     * #ifdef #ifndef #if #else #elif #endif - директиви за условна компилация
     * 
     * #undef - отменя декларацията на макрос
     * #error - принтиране на грешки по време на препроцесинг
     * #pragma - която се използва за специални инструкци към компилатора
     * 
     * ... - други препроцесорни директиви
     */

    return 0;
}