#include <stdio.h>

/**
 * __FILE__ - символен низ, който съдържа името на файла, който се обработва от препроцесора на C
 * __LINE__ - цяло число, което съдържа номерът на линията, на която се намира това макро
 * __DATE__ - символен низ, който съдържа датата на която е обработен този файл, от препроцесорът на C
 * __TIME__ - символен низ, който съдържа часа, когато файлът е обработен от препроцесорът 
 */

int main(void) {

    printf("%s\n", __FILE__);
    printf("%d\n", __LINE__);
    printf("%s\n", __DATE__);
    printf("%s\n", __TIME__);

    return 0;
}