#include <stdio.h>

int main(void) {
    /**
     * Preprocessor directive:
     * #include - вмъкване на заглавни файлове
     * #define - за дефиниране на така наречените макроси
     * 
     * #ifdef #ifndef #if #else #elif #endif- директиви за условна компилация
     * 
     * #undef - отмяна на декларация на макрос
     * #error - за грешка - за принтиране на грешка от препроцесора
     * #pragma - която се използва за допълнителни инструкции към компилатора
     * 
     * ... - освен тях може да има допълнителни директиви
     */

    return 0;
}