#include <stdio.h>

/**
 * __FILE__ - връща символен низ, който съдържа името на файла, който се обработва от препроцесора
 * __LINE__ - връща номерът (цяло число) на линията, на която се среща това макро
 * __DATE__ - датата, на която се е извършила препроцесорната обработка
 * __TIME__ - времето, на което се извършила препроцесорната обработка
 */

int main() {

    printf("%s\n", __FILE__);
    printf("%d\n", __LINE__);
    printf("%s\n", __DATE__);
    printf("%s\n", __TIME__);

    return 0;
}