#include <stdio.h>

int main(void) {

  //6 - 00000110 
  char c = 6;

  //One's complement - обратен код:
  //6 is binary is:           00000110
  //One's complement of 6 is: 11111001
  //=> -6 == 11111001
  //+0  == 00000000
  //-0  == 11111111 =>
  //от 256 две от тях са за -0 и + 0 => 254 стойности за други числа =>
  //=> обхвата от стойност == -127 - 0, 0 - +127

  //Тwo's complement - допълнителен код
  //Two's complement = One's complement + 1 
  //Two's complement of 6 = One's complement of 6 + 1 =>
  //Two's complement of 6 = 11111001 + 1 == 11111010
  //При допълнителен код имаме само 1 нула => 0000 0000 => 11111111 + 1 =>(1) 0000 0000 =>
  //=> имаме 256 - 1 = 255 стойности за други числа =>
  //=> обхвата от стойности = -128 - 0, 0 - +127
  char c1 = 250;
  printf("%d\n", c1);

  //Sign magnitude representation - знаков бит
  //Тук използваме най-старшия бит за знак на числото (0) - положително, (1) - отрицателно
  //Числото 6 =    0000 0110
  //Числото -6 =   1000 0110
  //Тук отново имаме 2 нули => 0000 0000 (+0) и 1000 0000 (-0) => 254 стойности за други числа =>
  //обхвата тук е от -127 - 0, 0 - +127
  


  return 0;
}