#include <stdio.h>

int main(void) {

  //6 int binary => 00000110
  //1 byte = 8 bit = 0 - 255
  char a = 6;

  //One's complement - Обратен код
  //-6 - 11111001 (обръщаме нулите на единици и единиците на нули)
  //00000000 = +0, 11111111 = -0 = 256 - 2 нули = 254 =>
  //=> обхвата от стойности = -127  -0, +0 - +127

  //Two's complement - Допълнителен код
  //Тwo's complement = One's complement + 1
  //Two's complement of 6 = 11111001 + 1 == 11111010 =>
  //-6 = 11111010 
  //11111010 = 0*2^0 + 1*2^1 + 0*2^2 + 2^3 + 2^4 + 2^5+ 2^6 + 2^7 
  //11111010 = 2 + 8 + 16 + 32 + 64 + 128 = 250
  //Only one zero => обхват == -128 - 0 - +127
  char x = 250;
  printf("%d\n", x);

  //Sign magnitude representation - знаков бит
  //6 == 0000 0110
  //-6 = 1000 0110
  //0000 0000 = +0, 1000 0000 = -0 => two representations of 0 =>
  //обхват = -127 - -0, +0 - +127

  return 0;
}